{
  "bio": "I pride myself on my adaptability and positive mindset. After a number of responsibilities during my time at Nike, I’ve had a wide breadth of exposure to different areas of software engineering. Anyone who’s worked with me might say I’m flexible, resourceful, a creative problem-solver, and I’m ready to quickly learn anything to get the job done.|I have been employed professionally as a developer since late 2018. After completing a full stack JavaScript program at Thinkful, I made my career debut in an internship role where I built out the User Interface for a web application platform for businesses in the cannabis industry. There, I successfully delivered an implementation with React+Redux, CSS, and vanilla JavaScript. I went on to work at Nike WHQ and have been there for the past two years. I provide technical solutions for analytics data collection across Nike’s digital products including nike.com and the mobile apps Nike+, SNKRS, Nike Run Club, and Nike Training Club. I developed a pixel tag and data transformation client library in TypeScript for dotcom. For Nike's apps, I developed a working prototype for a mobile analytics client library in Swift. Plus, I have experience in backend microservice development with Golang.|With my skills and experience, I’m looking to make an impact wherever Life takes me. I thrive in teams with friendly collaboration and knowledge-sharing values. Let’s level up our skills and keep improving every single day — together.|So, what brings you to my web portfolio? Please reach out by any of the media listed in the “Contact” tab and I’d be happy to connect, especially if it is regarding professionally relevant opportunities. After hours I’m practicing meditation, seeking personal growth, and cuddling with my special dog, Brody.",
  "projects": [
    {
      "header": "Student Portal",
      "projectLink": "https://student-portal-balletbody.herokuapp.com/",
      "clientRepo": "https://github.com/JasminTrotter/student-portal-client",
      "apiRepo": "https://github.com/JasminTrotter/student-portal-api",
      "image": "./screenshots/macbook-studentportal.png",
      "description": "As the owner of Ballet Body by Jasmin, a beginning ballet program for adults, I am both the developer and consumer of my software products. I created <>Student Portal</> out of a need to provide my ballet students with a convenient way of purchasing classes and reviewing a list of their purchase history.",
      "techDescription": "Student Portal is a full stack, responsive web application. This app utilizes a MongoDB database, Node server with Express, React and Redux for the user interface, JSON Web Tokens for authentication, and Stripe API for payment processing.",
      "techList": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "ReactJS",
        "Redux",
        "Node.js",
        "Express",
        "mLab",
        "Travis CI",
        "Heroku"
      ]
    },
    {
      "header": "Ballet Body by Jasmin",
      "projectLink": "https://www.balletbodybyjasmin.com/",
      "repo": "https://github.com/JasminTrotter/ballet-body-by-jasmin",
      "image": "./screenshots/macbook-balletbody.png",
      "description": "Ballet Body by Jasmin is a beginning ballet program for adults. This project is an informational website for the business.",
      "techList": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "ReactJS"
      ]
    },
    {
      "header": "Join Class",
      "projectLink": "https://join-class.herokuapp.com/",
      "repo": "https://github.com/JasminTrotter/Join-Class-App",
      "image": "./screenshots/macbook-joinclass.png",
      "description": "On Join Class, users (ballet students) can sign up for ballet class, view the schedule of classes, and cancel any current reservations.",
      "techList": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "jQuery",
        "Node.js",
        "Express",
        "mLab",
        "Mocha",
        "Chai",
        "Travis CI"
      ]
    },
    {
      "header": "Quotumblr",
      "projectLink": "https://jasmintrotter.github.io/quotumblr/",
      "repo": "https://github.com/JasminTrotter/quotumblr",
      "image": "./screenshots/macbook-quotumblr.png",
      "description": "I love a good quote, especially when I happen upon one serendipitously and it makes my day. A fun API hack, this responsive web application integrates with two third-party APIs: Tumblr and FavQ's. The user starts with entering their Tumblr username, then selects a text post from their Tumblr feed. Quotumblr chooses a random word from the selected post, then using FavQ's API, returns a quote containing that word.",
      "techList": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "jQuery"
      ]
    }
  ],
  "logos": [
    {
      "label": "HTML5",
      "src": "./logos/htmllogo.png"
    },
    {
      "label": "CSS3",
      "src": "./logos/csslogo.png"
    },
    {
      "label": "JavaScript",
      "src": "./logos/javascriptlogo.png"
    },
    {
      "label": "ReactJS",
      "src": "./logos/reactlogo.png"
    },
    {
      "label": "Redux",
      "src": "./logos/reduxlogo.png"
    },
    {
      "label": "Node.js",
      "src": "./logos/nodelogo.png"
    },
    {
      "label": "Express",
      "src": "./logos/expresslogo.jpg"
    },
    {
      "label": "mLab",
      "src": "./logos/mlablogo.png"
    },
    {
      "label": "Enzyme",
      "src": ""
    },
    {
      "label": "Travis CI",
      "src": "./logos/traviscilogo.png"
    },
    {
      "label": "Heroku",
      "src": "./logos/herokulogo.jpg"
    },
    {
      "label": "jQuery",
      "src": "./logos/jquerylogo.gif"
    },
    {
      "label": "gmail",
      "src": "https://lh3.googleusercontent.com/uLJRU-SUFtPkKNA1ok-9Fg2sXtBE7JKdICa9I4VRHCp30wZEVj7aXFEDwico9c6g2o5GZW9VJwAKgqOXVvi9n8qSxr_6d2bmsL3Ipb1h0zwsYIMGy-3zTseNF8oU4tEIZqVS3izdOA=s225-p-k"
    },
    {
      "label": "LinkedIn",
      "src": "./logos/linkedinlogo.png"
    },
    {
      "label": "GitHub",
      "src": "./logos/githublogo.png"
    }
  ]
}
